src/BusinessProcesses/ВзаимодействиеСРОЭ/ВзаимодействиеСРОЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ВзаимодействиеСРОЭ</name>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задач точки действия Выполнить для исполнителя</comment>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <comment>Результат выполнения задания после завершения бизнес-процесса.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <comment>Фактическая дата завершения бизнес-процесса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Описание задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаПроверке</name>
    <comment>Признак того, что указан проверяющий по задаче</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИтерации</name>
    <comment>Количество циклов бизнес-процесса между исполнителем и проверяющим</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <comment>Внутреннее состояние бизнес-процесса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <comment>Объект системы, &quot;по поводу&quot; которого был создан бизнес-процесс.</comment>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <comment>История переписки исполнителя и проверяющего</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнееЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаИсточник</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПредмета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресацииПроверяющий</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресацииПроверяющий</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадачПроверяющий</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаПС</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеАнгл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обозначение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Входимость</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредприятияИзготовителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодОКПОПредприятияИзготовителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Применяемость</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>NSN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RN_TRANSLIT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ORIG_NAME_RU</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ORIG_NAME_ENG</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ORIG_NAME_TRANSLIT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>INC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NAME_EN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NAME_RU</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NSG</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NSC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NCAGE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CODIFIED_BY</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NAME_ORG</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NAME_ORG_TRANSLIT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CIN</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DATE_CREA</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DATE_ASSI</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DATE_CANC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TIIC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RPDMRC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KIDN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RNCC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RNVC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DAC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RNJC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RNSC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RNFC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RNAAC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>N_STROKI</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

src/BusinessProcesses/ВзаимодействиеСРОЭ/Forms/ФормаЗадач/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Для нового объекта выполняем код инициализации формы в ПриСозданииНаСервере.
	// Для существующего - в ПриЧтенииНаСервере.
	Если Объект.Ссылка.Пустая() Тогда
		ИнициализацияФормы();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	АвторСтрокой = Строка(Объект.Автор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаПредметовСнабжения, "Ссылка", Объект.БизнесПроцесс, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	БизнесПроцессыИЗадачиКлиент.ФормаЗадачиОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияОткрытьФормуЗадачиНажатие(Элемент)
	
	ПоказатьЗначение(,Объект.Ссылка);
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Объект.Предмет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИсполненияПриИзменении(Элемент)
	
	Если Объект.ДатаИсполнения = НачалоДня(Объект.ДатаИсполнения) Тогда
		Объект.ДатаИсполнения = КонецДня(Объект.ДатаИсполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить(Команда)
	
	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ЭтоТочкаМарштрутаОжиданиеПолученияОтвета()
	
	Возврат Объект.ТочкаМаршрута = БизнесПроцессы.ВзаимодействиеСРОЭ.ТочкиМаршрута.ОжиданиеПолученияОтвета;
	
КонецФункции

&НаКлиенте
Процедура ВыполненаВыполнить(Команда)

	Объект.ВариантВыбораДляЗагрузки = 1;

	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтотОбъект, Истина);

КонецПроцедуры

&НаКлиенте
Процедура Дополнительно(Команда)
	
	БизнесПроцессыИЗадачиКлиент.ОткрытьДопИнформациюОЗадаче(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ПодключитсяКЭксель(ИмяФайла)
	
	XLSОбъект = Новый COMОбъект("Excel.Application"); 
	
    Попытка
        Эксель = XLSОбъект.Workbooks.Open(ИмяФайла, , Истина);
    Исключение
		Инф = ИнформацияОбОшибке();
		Сообщить ("Проблемы с подключением к Excel: " + Инф.Причина.Описание);
		Возврат Неопределено;
    КонецПопытки;
	
	Возврат Эксель; 
	
КонецФункции

&НаСервере
Функция ОбновитьДанныеБизнецПроцесса()
	
	Результат = Новый Структура("Выполнено, Описание", Истина, "");
	
	БизнесПроцессОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
	
	ТаблЧасть = БизнесПроцессОбъект.ПредметыСнабжения;
	
	Для каждого Стр Из ТаблицаЗагрузки Цикл
		
		Если СокрЛП(Стр.N_STROKI) = "" Тогда
			ТекСтрока = Неопределено;
		Иначе
			ТекСтрока = ТаблЧасть.Найти(Число(Стр.N_STROKI), "НомерСтроки");
		КонецЕсли; 
		
		Если НЕ ТекСтрока = Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(ТекСтрока, Стр);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Попытка
		БизнесПроцессОбъект.Записать();
		Результат.Выполнено = Истина;
	Исключение
	    ОписаниеОшибки = ОписаниеОшибки();
		Результат.Выполнено = Ложь;
		Результат.Описание = ОписаниеОшибки;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
 
&НаКлиенте
Функция ЗагрузитьФайлИОбновитьТЧ()
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Табличный документ(*.xls);Табличный документ(*.xlsx)|*.xls;*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	Если ИмяФайла = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Состояние("Начало загрузки",0, "Загрузка из файла");
	
	Эксель = ПодключитсяКЭксель(ИмяФайла);
	
	ТаблицаЗагрузки.Очистить();
	
	ЛистЭксель = Эксель.WorkSheets(1); 
	
	ВсегоСтрок = ЛистЭксель.Cells.SpecialCells(11).Row; 
	ВсегоКолонок = ЛистЭксель.Cells.SpecialCells(11).Column;
	
	Для сч = 2 По ВсегоСтрок Цикл // Самую первую пропускаем
		
		Если СокрЛП(ЛистЭксель.Cells(сч,  1).value) = "" Тогда
			Продолжить;
		КонецЕсли; 
		
		НовСтр = ТаблицаЗагрузки.Добавить();
		
		НовСтр.NSN 					= СокрЛП(ЛистЭксель.Cells(сч,  1).value);
		НовСтр.RN 					= СокрЛП(ЛистЭксель.Cells(сч,  2).value);
		НовСтр.RN_TRANSLIT 			= СокрЛП(ЛистЭксель.Cells(сч,  3).value);
		НовСтр.ORIG_NAME_RU 		= СокрЛП(ЛистЭксель.Cells(сч,  4).value);
		НовСтр.ORIG_NAME_ENG 		= СокрЛП(ЛистЭксель.Cells(сч,  5).value);
		НовСтр.ORIG_NAME_TRANSLIT 	= СокрЛП(ЛистЭксель.Cells(сч,  6).value);
		НовСтр.INC					= СокрЛП(ЛистЭксель.Cells(сч,  7).value);
		НовСтр.NAME_EN				= СокрЛП(ЛистЭксель.Cells(сч,  8).value);
		НовСтр.NAME_RU 				= СокрЛП(ЛистЭксель.Cells(сч,  9).value);
		НовСтр.NSG 					= СокрЛП(ЛистЭксель.Cells(сч, 10).value);
		НовСтр.NSC 					= СокрЛП(ЛистЭксель.Cells(сч, 11).value);
		НовСтр.NCAGE 				= СокрЛП(ЛистЭксель.Cells(сч, 12).value);
		НовСтр.CODIFIED_BY 			= СокрЛП(ЛистЭксель.Cells(сч, 13).value);
		НовСтр.NAME_ORG 			= СокрЛП(ЛистЭксель.Cells(сч, 14).value);
		НовСтр.NAME_ORG_TRANSLIT 	= СокрЛП(ЛистЭксель.Cells(сч, 15).value);
		НовСтр.CIN 					= СокрЛП(ЛистЭксель.Cells(сч, 16).value);
		НовСтр.DATE_CREA 			= СокрЛП(ЛистЭксель.Cells(сч, 17).value);
		НовСтр.DATE_ASSI 			= СокрЛП(ЛистЭксель.Cells(сч, 18).value);
		НовСтр.DATE_CANC 			= СокрЛП(ЛистЭксель.Cells(сч, 19).value);
		НовСтр.TIIC 				= СокрЛП(ЛистЭксель.Cells(сч, 20).value);
		НовСтр.RPDMRC 				= СокрЛП(ЛистЭксель.Cells(сч, 21).value);
		НовСтр.KIDN 				= СокрЛП(ЛистЭксель.Cells(сч, 22).value);
		НовСтр.RNCC 				= СокрЛП(ЛистЭксель.Cells(сч, 23).value);
		НовСтр.RNVC 				= СокрЛП(ЛистЭксель.Cells(сч, 24).value);
		НовСтр.DAC 					= СокрЛП(ЛистЭксель.Cells(сч, 25).value);
		НовСтр.RNJC 				= СокрЛП(ЛистЭксель.Cells(сч, 26).value);
		НовСтр.RNSC 				= СокрЛП(ЛистЭксель.Cells(сч, 27).value);
		НовСтр.RNFC 				= СокрЛП(ЛистЭксель.Cells(сч, 28).value);
		НовСтр.RNAAC 				= СокрЛП(ЛистЭксель.Cells(сч, 29).value);
		НовСтр.N_STROKI 			= СокрЛП(ЛистЭксель.Cells(сч, 30).value);
		
		Состояние("Идет загрузка", сч-1, "Загрузка из файла");
		
	КонецЦикла;
	
	Результат = ОбновитьДанныеБизнецПроцесса();
	
	Если Результат.Выполнено Тогда
		
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));

		ДобавитьФайлВПрисоединенныеФайлы(ИмяФайла, АдресВоВременномХранилище);
		
		Состояние("Загрузка завершена", 100,"Загрузка из файла");
		
	Иначе
		
		Объект.РезультатВыполнения = Объект.РезультатВыполнения + Символы.ПС + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + " Ошибка: " + Результат.Описание;
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьФайлВПрисоединенныеФайлы(ПутьКФайлу, АдресВоВременномХранилище)
	
	ПолныйФайл= ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлу);
	ИмяБезРасширения   = ПолныйФайл.ИмяБезРасширения;
	РасширениеБезТочки = СтрЗаменить(ПолныйФайл.Расширение, ".", "");
	
	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("ВладелецФайлов",              Объект.БизнесПроцесс);
	ПараметрыФайла.Вставить("Автор",                       ПараметрыСеанса.ТекущийПользователь);
	ПараметрыФайла.Вставить("ИмяБезРасширения",            ИмяБезРасширения);
	ПараметрыФайла.Вставить("РасширениеБезТочки",          РасширениеБезТочки);
	ПараметрыФайла.Вставить("ВремяИзменения",              Неопределено);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
	
	ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(ПараметрыФайла, АдресВоВременномХранилище, "", "");
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы()
	
	Если ЗначениеЗаполнено(Объект.БизнесПроцесс) Тогда
		ПараметрыФормы = БизнесПроцессыИЗадачиВызовСервера.ФормаВыполненияЗадачи(Объект.Ссылка);
		ЕстьФормаЗадачи = ПараметрыФормы.Свойство("ИмяФормы");
		//Элементы.ГруппаФормаВыполнения.Видимость = ЕстьФормаЗадачи;
		Элементы.Выполнена.Доступность = НЕ ЕстьФормаЗадачи;
	//Иначе
	//	Элементы.ГруппаФормаВыполнения.Видимость = Ложь;
	КонецЕсли;
	НачальныйПризнакВыполнения = Объект.Выполнена;
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
		Объект.СрокИсполнения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Элементы.Предмет.Гиперссылка = Объект.Предмет <> Неопределено И НЕ Объект.Предмет.Пустая();
	ПредметСтрокой = ОбщегоНазначения.ПредметСтрокой(Объект.Предмет);	
	
	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	Элементы.СрокНачалаИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	Элементы.ДатаИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	БизнесПроцессыИЗадачиСервер.УстановитьФорматДаты(Элементы.СрокИсполнения);
	БизнесПроцессыИЗадачиСервер.УстановитьФорматДаты(Элементы.Дата);
	
	БизнесПроцессыИЗадачиСервер.ФормаЗадачиПриСозданииНаСервере(ЭтотОбъект, Объект, 
		Элементы.ГруппаСостояние, Элементы.ДатаИсполнения);
		
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		Элементы.Автор.Видимость = Ложь;
		Элементы.АвторСтрокой.Видимость = Истина;
		Элементы.Исполнитель.КнопкаОткрытия = Ложь;
	КонецЕсли;
	
	Элементы.Выполнена.Доступность = ПравоДоступа("Изменение", Метаданные.Задачи.ЗадачаИсполнителя);
	
	// + 16.01.2018 10:58:37 Базунов Д.А. Задача: 

	Если НЕ Объект.Описание = "" Тогда
		Элементы.Описание.Видимость = Истина;
	Иначе
		Элементы.Описание.Видимость = Ложь;
	КонецЕсли; 
	
	Если Объект.РольИсполнителя.Пустая() Тогда
		Элементы.РольИсполнителя.Видимость = Ложь;
		Элементы.Исполнитель.Видимость = Истина;
	Иначе
		Элементы.РольИсполнителя.Видимость = Истина;
		Элементы.Исполнитель.Видимость = Ложь;
	КонецЕсли;
	
	ТочкиМаршрута = БизнесПроцессы.ВзаимодействиеСРОЭ.ТочкиМаршрута;
	
	Если Объект.ТочкаМаршрута = ТочкиМаршрута.ОжиданиеПолученияОтвета Тогда
		Элементы.ТаблицаПредметовСнабжения.ТолькоПросмотр = Истина;
		Элементы.ГруппаВариантыВыбора.Видимость = Истина;
		Элементы.Отклонить.Видимость = Истина;
	ИначеЕсли Объект.ТочкаМаршрута = ТочкиМаршрута.ОбновлениеДанныхВКаталогеПС Тогда
		ТолькоПросмотр = Истина;
		Элементы.ГруппаВариантыВыбора.Видимость = Ложь;
	КонецЕсли; 
	
	Если Объект.Выполнена Тогда
		Элементы.Выполнена.Доступность = Ложь;
		Элементы.ДатаИсполнения.Доступность = Ложь;
		Элементы.ДатаИсполненияВремя.Доступность = Ложь;
		Элементы.ГруппаВариантыВыбора.Доступность = Ложь;
		Элементы.Отклонить.Доступность = Ложь;
	КонецЕсли;
	
	// - 16.01.2018 10:58:37 Базунов Д.А. Задача: 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПредметовСнабженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ПредметСнабжения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СокрЛП(Объект.РезультатВыполнения) = "" Тогда
		Если Объект.ВыбранныйВариант = "" Тогда
			Объект.РезультатВыполнения = "Выполнена";
		Иначе
			Объект.РезультатВыполнения = СокрЛП(Объект.ВыбранныйВариант);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ЗагрузитьФайлИОбновитьТЧ();
	
	Элементы.ТаблицаПредметовСнабжения.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	Объект.ВариантВыбораДляЗагрузки = 2;
	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтотОбъект, Истина);	
	
КонецПроцедуры

#КонецОбласти
